θ_CA_constant_Pr = (CᴷRiʷ = 0.0,
                    CᴷRiᶜ = 0.0,
                    Cᴷu⁻ = 0.942,
                    Cᴷc⁻ = 0.738,
                    Cᴷe⁻ = 0.26,
                    Cᴷuʳ = 0.0,
                    Cᴷcʳ = 0.0,
                    Cᴷeʳ = 0.0,
                    Cᵟu  = 0.5,
                    Cᵟc  = 0.642,
                    Cᵟe  = 5.0,
                    Cᴬu  = 0.0,
                    Cᴬc  = 0.0,
                    Cᴬe  = 0.186,
                    Cᴰ   = 2.97,
                    Cᴸᵇ  = 1.62,
                    Cᵂu★ = 0.95,
                    CᵂwΔ = 2.51)

θ_constant_Pr = (
                 CᵂwΔ  = 8.38,
                 Cᵂu★  = 9.06,
                 Cᴰ    = 1.37,
                 Cᴸᵇ   = 1.13,
                 Cᴷu⁻  = 0.0887,
                 Cᴷc⁻  = 0.164,
                 Cᴷe⁻  = 2.13,
                 Cᴷuʳ  = 0.0,
                 Cᴷcʳ  = 0.0,
                 Cᴷeʳ  = 0.0,
                 CᴷRiʷ = 0.0,
                 CᴷRiᶜ = 0.0,
                 Cᴬu   = 0.0,
                 Cᴬc   = 0.0,
                 Cᴬe   = 0.0,
                 Cᵟu   = 0.5,
                 Cᵟc   = 0.5,
                 Cᵟe   = 0.5,
                )

θ_variable_Pr = (
                 CᵂwΔ  = 8.26,
                 Cᵂu★  = 6.81,
                 Cᴰ    = 1.67,
                 Cᴸᵇ   = 1.11,
                 Cᴷu⁻  = 0.0878,
                 Cᴷc⁻  = 0.154,
                 Cᴷe⁻  = 2.65,
                 Cᴷuʳ  = 1.27,
                 Cᴷcʳ  = 0.103,
                 Cᴷeʳ  = 8.85,
                 CᴷRiʷ = 2.01,
                 CᴷRiᶜ = 2.63,
                 Cᴬu   = 0.0,
                 Cᴬc   = 0.0,
                 Cᴬe   = 0.0,
                 Cᵟu   = 0.5,
                 Cᵟc   = 0.5,
                 Cᵟe   = 0.5,
                )


#=

Cᴷu⁻ = 0.2739
Cᴷu⁺ = 1.8625
Cᴷc⁻ = 0.2573
Cᴷc⁺ = 1.4961
Cᴷe⁻ = 0.2941
Cᴷe⁺ = 1.3852

# 1. C⁻ + C⁺ * step
# 2. C⁻ (1 + Cʳ * step)
# => Cʳ = C⁺ / C⁻
Cᴷuʳ = Cᴷu⁺ / Cᴷu⁻
Cᴷcʳ = Cᴷc⁺ / Cᴷc⁻
Cᴷeʳ = Cᴷe⁺ / Cᴷe⁻

# 1. x/w - c/w
# 2. x/w - c
# => c = w*c
CᴷRiʷ = 0.6487

θ_variable_Ri = (CᴷRiʷ = 0.6487,
                 CᴷRiᶜ = 1.9231 * CᴷRiʷ,
                 Cᴷu⁻ = 0.2739,
                 Cᴷuʳ = Cᴷu⁺ / Cᴷu⁻,
                 Cᴷc⁻ = 0.2573,
                 Cᴷcʳ = Cᴷc⁺ / Cᴷc⁻,
                 Cᴷe⁻ = 0.2941,
                 Cᴷeʳ = Cᴷe⁺ / Cᴷe⁻,
                 Cᵟu  = 0.5,
                 Cᵟc  = 0.5,
                 Cᵟe  = 0.5,
                 Cᴰ   = 3.0376,
                 Cᴸᵇ  = 1.6998,
                 Cᵂu★ = 3.5992,
                 CᵂwΔ = 1.8507)

θ_constant_Ri = (; Cᴸᵇ   = 1.36,
                   Cᴷu⁻  = 0.101,
                   Cᴷc⁻  = 0.0574,
                   Cᴷe⁻  = 3.32,
                   Cᵟu   = 0.296,
                   Cᵟc   = 1.32,
                   Cᵟe   = 1.49,
                   CᵂwΔ  = 4.74,
                   Cᵂu★  = 2.76,
                   Cᴰ    = 1.78,
                   Cᴷuʳ  = 0.0,
                   Cᴷcʳ  = 0.0,
                   Cᴷeʳ  = 0.0,
                   CᴷRiʷ = 0.0,
                   CᴷRiᶜ = 0.0)
=#
